Revit 2026 API

# FabricationPartPlacementUtils Class

---

General utility placement methods in the Autodesk Revit MEP product for fabrication.

SystemObject Autodesk.Revit.DB.FabricationFabricationPartPlacementUtils

**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class FabricationPartPlacementUtils
```
```vb
Public NotInheritable Class FabricationPartPlacementUtils
```
```cpp
public ref class FabricationPartPlacementUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FabricationPartPlacementUtils = class end
```

#### Reference

Autodesk.Revit.DB.Fabrication Namespace